Revit 2027 API
HermiteSpline.Create Method
Overload List
Name | Description
Create(IList<XYZ>, Boolean) |  Creates a Hermite spline with default tangency at its endpoints.
Create(IList<XYZ>, Boolean, HermiteSplineTangents) |  Creates a Hermite spline with specified tangency at its endpoints.
Top
See Also
Reference
HermiteSpline Class
Autodesk.Revit.DB Namespace